doc/why.org
#+TITLE:Why Visi?
#+AUTHOR: David Pollak
#+EMAIL: feeder.of.the.bears@gmail.com
#+BABEL: :session *Clojure* :cache yes :results output graphics :exports both :tangle yes

* Why Visi?
** What is Visi?

Visi is a computer language that allows expression of big data jobs
in a syntax that's not frightening to people familiar with Excel formula functions.
There is more in Visi than there is in Excel formula functions,
but the "more" is adding to what's in Excel.

Let's start with a simple expression... a thing that executes
code and returns a value:

#+BEGIN_SRC visi
 1 + 1
#+END_SRC

#+RESULTS:
: 2

That's simple, the expression evaluates to src_visi{1 + 1}. Yay!

In Excel, each cell is a variable... something that can contain
a value. In Excel, cells can be constants (values that do not change)
or formulas. If a cell contains a formula and that formula refers
to another cell, when the predicate cell's value changes, all
the dependent cells update their values.

In Visi, you name the placeholders for values.
So, to create a names:

#+BEGIN_SRC visi

x = 5

y = x + 5

#+END_SRC


The above code created names "x" and "y". "x" is a constant
and "y" is dependent on "x".

In Visi and Excel, you can apply a function to a value:

#+BEGIN_SRC visi :exports both

## Define a name that's associated with a String
a1 = "The Brown Cow"

## Calculate the length of the string
length(a1)

#+END_SRC

#+RESULTS:
: 13

Visi groups names of functions and other values (in Visi functions
are values) into different packages. Functions in packages can
be referenced with =package::name= like:

#+NAME: sin
#+BEGIN_SRC visi :exports both

Math::sin(0.5)

#+END_SRC

Computes to:

#+RESULTS: sin
: 0.479425538604203


In Excel, there are lots and lots of different functions. They are
all in the same group, although the user interface (Insert Function)
lets you pick
functions from categories like "Statistical" or "Financial".

In Visi, functions are grouped in separately named "packages" so that it's easier
to find a function you're looking for and sometimes, like in the
above example, we have to be explicit about which package the
function lives in. The =::= between =Math= and =sin= tells Visi
to look in the =Math= package for the function.

With Visi, you can use any Java package as part of your Visi notebook.
We will cover Java "Host Interoperability" and how to load Java JAR
files into your Visi notebook later in this document.

A declaration is the association of a value with a name
such that the named declaration can be accessed
by other parts of your notebook. For example:

#+NAME: cos_third_pi
#+BEGIN_SRC visi :export both

Math::cos(Math::PI / 3) ## expression

cos_third_pi = Math::cos(Math::PI / 3) ## declaration

cos_third_pi ## referencing the name

#+END_SRC

#+RESULTS: cos_third_pi
: [0.5000000000000001, 0.5000000000000001]


In Visi, you can create your own functions. So you can use
the same logic in many places without having to copy/paste that logic
over and over:

#+BEGIN_SRC visi

calc_tax(income) = income * if(income > 5,000, 40%, 20%)

#+END_SRC


The above function computes the tax amount depending on the income level.

And functions can call other functions:

#+BEGIN_SRC visi

tax_rate(income) = if(income > 5,000, 40%, 20%)

calc_tax(income) = income * tax_rate(income)

#+END_SRC

Visi syntax can span multiple lines and if/then/else can be
a formula and it has its own syntax that might be easier to read:

#+BEGIN_SRC visi

tax_rate(income) =
  if income > 5,000 then
    40%
  else
    20%

calc_tax(income) = income * tax_rate(income)

#+END_SRC

And Visi code can contain comments so that you and others who
read the code can understand what's going on:

#+BEGIN_SRC visi

tax_rate(income) =
  if income > 5,000 then
    40% ## for high incomes
  else
    20% ## for lower incomes

calc_tax(income) = income * tax_rate(income)

#+END_SRC

To summarize, Visi syntax is a lot like Excel syntax, but
there are extensions to what you are familiar with in Excel to
make writing more complex Visi notebooks easier.

