doc/why.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Why Visi?</title>
<!-- 2015-02-07 Sat 15:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="David Pollak" />
</head>
<body>
<div id="content">
<h1 class="title">Why Visi?</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Why Visi?</a>
<ul>
<li><a href="#sec-1-1">1.1. What is Visi?</a></li>
<li><a href="#sec-1-2">1.2. Core Concepts</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. But why functions?</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Immutability</a></li>
<li><a href="#sec-1-4">1.4. Host Interoperability</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Why Visi?</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> What is Visi?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Visi is a computer language that allows expression of big data jobs
in a syntax that's not frightening to people familiar with Excel formula functions.
There is more in Visi than there is in Excel formula functions,
but the "more" is adding to what's in Excel.
</p>

<p>
Let's start with a simple expression&#x2026; a thing that executes
code and returns a value:
</p>

<div class="org-src-container">

<pre class="src src-visi">1 <span style="color: #7CB8BB;">+</span> 1
</pre>
</div>

<p>
That's simple, the expression evaluates to <code>2</code>. Yay!
</p>

<p>
In Excel, each cell is a variable&#x2026; something that can contain
a value. In Excel, cells can be constants (values that do not change)
or formulas. If a cell contains a formula and that formula refers
to another cell, when the predicate cell's value changes, all
the dependent cells update their values.
</p>

<p>
In Visi, you name the placeholders for values.
So, to create a names:
</p>

<div class="org-src-container">

<pre class="src src-visi">x <span style="color: #7CB8BB;">=</span> 5

y <span style="color: #7CB8BB;">=</span> x <span style="color: #7CB8BB;">+</span> 5
</pre>
</div>


<p>
The above code created names "x" and "y". "x" is a constant
and "y" is dependent on "x".
</p>

<p>
In Visi and Excel, you can apply a function to a value:
</p>

<div class="org-src-container">

<pre class="src src-visi"><span style="color: #7F9F7F;">## Define a name that's associated with a String</span>
a1 <span style="color: #7CB8BB;">=</span> <span style="color: #CC9393;">"The Brown Cow"</span>

<span style="color: #7F9F7F;">## Calculate the length of the string</span>
length(a1)
</pre>
</div>

<pre class="example">
13
</pre>

<p>
Visi groups names of functions and other values (in Visi functions
are values) into different packages. Functions in packages can
be referenced with <code>package::name</code> like:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="sin">Math:<span style="color: #BFEBBF;">:sin</span>(0.5)
</pre>
</div>

<p>
Computes to:
</p>

<pre class="example">
0.479425538604203
</pre>


<p>
In Excel, there are lots and lots of different functions. They are
all in the same group, although the user interface (Insert Function)
lets you pick
functions from categories like "Statistical" or "Financial".
</p>

<p>
In Visi, functions are grouped in separately named "packages" so that it's easier
to find a function you're looking for and sometimes, like in the
above example, we have to be explicit about which package the
function lives in. The <code>::</code> between <code>Math</code> and <code>sin</code> tells Visi
to look in the <code>Math</code> package for the function.
</p>

<p>
With Visi, you can use any Java package as part of your Visi notebook.
We will cover Java "Host Interoperability" and how to load Java JAR
files into your Visi notebook later in this document.
</p>

<p>
A declaration is the association of a value with a name
such that the named declaration can be accessed
by other parts of your notebook. For example:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="cos_third_pi">Math:<span style="color: #BFEBBF;">:cos</span>(Math:<span style="color: #BFEBBF;">:PI</span> / 3) <span style="color: #7F9F7F;">## expression</span>

cos_third_pi <span style="color: #7CB8BB;">=</span> Math:<span style="color: #BFEBBF;">:cos</span>(Math:<span style="color: #BFEBBF;">:PI</span> / 3) <span style="color: #7F9F7F;">## declaration</span>

cos_third_pi <span style="color: #7F9F7F;">## referencing the name</span>
</pre>
</div>


<p>
In Visi, you can create your own functions. So you can use
the same logic in many places without having to copy/paste that logic
over and over:
</p>

<div class="org-src-container">

<pre class="src src-visi">calc_tax(income) <span style="color: #7CB8BB;">=</span> income * <span style="color: #F0DFAF; font-weight: bold;">if</span>(income <span style="color: #7CB8BB;">&gt;</span> 5,000, 40%, 20%)
</pre>
</div>


<p>
The above function computes the tax amount depending on the income level.
</p>

<p>
And functions can call other functions:
</p>

<div class="org-src-container">

<pre class="src src-visi">tax_rate(income) <span style="color: #7CB8BB;">=</span> <span style="color: #F0DFAF; font-weight: bold;">if</span>(income <span style="color: #7CB8BB;">&gt;</span> 5,000, 40%, 20%)

calc_tax(income) <span style="color: #7CB8BB;">=</span> income * tax_rate(income)
</pre>
</div>

<p>
Visi syntax can span multiple lines and if/then/else can be
a formula and it has its own syntax that might be easier to read:
</p>

<div class="org-src-container">

<pre class="src src-visi">tax_rate(income) <span style="color: #7CB8BB;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span> income <span style="color: #7CB8BB;">&gt;</span> 5,000 <span style="color: #F0DFAF; font-weight: bold;">then</span>
    40%
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    20%

calc_tax(income) <span style="color: #7CB8BB;">=</span> income * tax_rate(income)
</pre>
</div>

<p>
And Visi code can contain comments so that you and others who
read the code can understand what's going on:
</p>

<div class="org-src-container">

<pre class="src src-visi">tax_rate(income) <span style="color: #7CB8BB;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span> income <span style="color: #7CB8BB;">&gt;</span> 5,000 <span style="color: #F0DFAF; font-weight: bold;">then</span>
    40% <span style="color: #7F9F7F;">## for high incomes</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    20% <span style="color: #7F9F7F;">## for lower incomes</span>

calc_tax(income) <span style="color: #7CB8BB;">=</span> income * tax_rate(income)
</pre>
</div>

<p>
To summarize, Visi syntax is a lot like Excel syntax, but
there are extensions to what you are familiar with in Excel to
make writing more complex Visi notebooks easier.
</p>
</div>
</div>
