doc/why.org
** Core Concepts

In Visi, there are three constructs: expressions, declarations,
and housekeeping.

An expression is a value that's computed.
Expressions can evaluate to either values or functions. Or
more precisely, functions are values just like numbers and
strings and collections.

What's a collection? It's a group of other values. For example:

#+BEGIN_SRC visi
[1, 2, 3, 4]
#+END_SRC

Is a collection of numbers. The specific collection type is
called a =Vector=. It's a 1 dimensional ordered array of values.
Ordered means that the Vector retains the elements in the
order that it was originally created.

Visi also supports sets. Sets are unordered collections
that contain unique values. So:

#+NAME: a-set
#+BEGIN_SRC visi :exports both
#{"foo", "bar", "baz", "foo", "dog", "dog", "baz"}
#+END_SRC

Only contains 4 elements:

#+RESULTS: a-set
: #{"foo" "bar" "dog" "baz"}

Another collection is an association. An association is collection of
unique keys and values. Both the keys and values
can be any Visi value. Let's create an association of people and
ages:

#+BEGIN_SRC visi
{"David" 51, "Archer" 11, "Tessa" 2}
#+END_SRC

#+RESULTS:
: {"Archer" 11, "Tessa" 2, "David" 51}

Note that like sets, the keys in an association are unordered.

If you are familiar with [[http://en.wikipedia.org/wiki/JavaScript][JavaScript]],
associations in Visi are like Objects in JavaScript... collections of
key/value pairs.

Visi also has a =keyword= type. Keywords are handy for
giving a common/shared name to a value in an association. For example:

#+BEGIN_SRC visi
[{name: "David", type: "Human", age: 51},
 {name: "Archer", type: "Dog", age: 11},
 {name: "Tessa", type: "Cat", age: 2}]
#+END_SRC

#+RESULTS:
: [{age: 51, name: "David", type: "Human"}, {age: 11, name: "Archer", type: "Dog"}, {age: 2, name: "Tessa", type: "Cat"}]

If you're familiar with JavaScript or [[http://json.org][JSON]],
the Visi syntax for defining an association looks just like JSON.
Familiarity is good.

In Visi, functions are values just like strings and numbers and
keywords.
The declaration of a function is just fancy syntax, both of
the following declarations mean the same thing (don't worry about the
function expression syntax for the moment):

#+NAME: plus_one
#+BEGIN_SRC visi :exports both

## assign a function to a name
plus_one = x => x + 1

another_plus_one(x) = x + 1

z = 99

plus_one(z) == another_plus_one(z)

#+END_SRC

Are the two functions the same?

#+RESULTS: plus_one
: true

The first example, assigns the expression =x => x + 1= to =plus_one=. That
expression evaluates to a function. The second example does the same thing
with different syntax. The latter is "syntactic sugar" for the former.

You may be asking, "why do you have more than one way to say the same thing?"
Good question. Visi creates syntactic sugar to give you a more concise
or more natural way of expressing the same code. In different contexts,
the different syntax may seem more natural. For example, the first
declaration looks kind of odd where the second looks like the way we
learned functions in math class. We will get to some examples of passing
functions as parameters in a little while.

In Visi, top level names (those names defined outside
another assignment) can be accessed by any expression
in a Visi notebook, just like values in cells in Excel.

