doc/why.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Core Concepts</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In Visi, there are three constructs: expressions, declarations,
and housekeeping.
</p>

<p>
An expression is a value that's computed.
Expressions can evaluate to either values or functions. Or
more precisely, functions are values just like numbers and
strings and collections.
</p>

<p>
What's a collection? It's a group of other values. For example:
</p>

<div class="org-src-container">

<pre class="src src-visi">[1, 2, 3, 4]
</pre>
</div>

<p>
Is a collection of numbers. The specific collection type is
called a <code>Vector</code>. It's a 1 dimensional ordered array of values.
Ordered means that the Vector retains the elements in the
order that it was originally created.
</p>

<p>
Visi also supports sets. Sets are unordered collections
that contain unique values. So:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="a-set">#{<span style="color: #CC9393;">"foo"</span>, <span style="color: #CC9393;">"bar"</span>, <span style="color: #CC9393;">"baz"</span>, <span style="color: #CC9393;">"foo"</span>, <span style="color: #CC9393;">"dog"</span>, <span style="color: #CC9393;">"dog"</span>, <span style="color: #CC9393;">"baz"</span>}
</pre>
</div>

<p>
Only contains 4 elements:
</p>

<pre class="example">
#{"foo", "bar", "dog", "baz"}
</pre>

<p>
Another collection is an association. An association is collection of
unique keys and values. Both the keys and values
can be any Visi value. Let's create an association of people and
ages:
</p>

<div class="org-src-container">

<pre class="src src-visi">{<span style="color: #CC9393;">"David"</span> 51, <span style="color: #CC9393;">"Archer"</span> 11, <span style="color: #CC9393;">"Tessa"</span> 2}
</pre>
</div>

<p>
Note that like sets, the keys in an association are unordered.
</p>

<p>
If you are familiar with <a href="http://en.wikipedia.org/wiki/JavaScript">JavaScript</a>,
associations in Visi are like Objects in JavaScript&#x2026; collections of
key/value pairs.
</p>

<p>
Visi also has a <code>keyword</code> type. Keywords are handy for
giving a common/shared name to a value in an association. For example:
</p>

<div class="org-src-container">

<pre class="src src-visi">[{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
 {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
 {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 2}]
</pre>
</div>

<p>
If you're familiar with JavaScript or <a href="http://json.org">JSON</a>,
the Visi syntax for defining an association looks just like JSON.
Familiarity is good.
</p>

<p>
In Visi, functions are values just like strings and numbers and
keywords.
The declaration of a function is just fancy syntax, both of
the following declarations mean the same thing (don't worry about the
function expression syntax for the moment):
</p>

<div class="org-src-container">

<pre class="src src-visi" id="plus_one"><span style="color: #7F9F7F;">## assign a function to a name</span>
plus_one <span style="color: #7CB8BB;">=</span> x =&gt; x <span style="color: #7CB8BB;">+</span> 1

another_plus_one(x) <span style="color: #7CB8BB;">=</span> x <span style="color: #7CB8BB;">+</span> 1

z <span style="color: #7CB8BB;">=</span> 99

plus_one(z) <span style="color: #7CB8BB;">==</span> another_plus_one(z)
</pre>
</div>

<p>
Are the two functions the same?
</p>

<pre class="example">
true
</pre>

<p>
The first example, assigns the expression <code>x =&gt; x + 1</code> to <code>plus_one</code>. That
expression evaluates to a function. The second example does the same thing
with different syntax. The latter is "syntactic sugar" for the former.
</p>

<p>
You may be asking, "why do you have more than one way to say the same thing?"
Good question. Visi creates syntactic sugar to give you a more concise
or more natural way of expressing the same code. In different contexts,
the different syntax may seem more natural. For example, the first
declaration looks kind of odd where the second looks like the way we
learned functions in math class. We will get to some examples of passing
functions as parameters in a little while.
</p>

<p>
In Visi, top level names (those names defined outside
another assignment) can be accessed by any expression
in a Visi notebook, just like values in cells in Excel.
</p>
</div>
