doc/why.html

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> But why functions?</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Functions take parameters and perform operations
on the parameters and return a value.
</p>

<p>
You're familiar with functions in Excel. Functions
are built into Excel, can be added via add-ins, and
via VisualBasic.
</p>

<p>
In Visi, there are plenty of sources of functions.
Some are built in, some can be packaged as JAR files
and downloaded, and some can be defined in your notebook.
</p>

<p>
Functions in Visi can be applied to every element of
a collection. This is called a <code>map</code> operation.
Hey&#x2026; that's part of MapReduce&#x2026; yes!
</p>

<p>
We're going to build a map/reduce job and see
how it works locally. The cool thing about Visi
is that you can explore a job locally and then
deploy the same job to a cluster of computers
running <a href="https://storm.apache.org/">Apache Storm</a>,
<a href="https://spark.apache.org/">Apache Spark</a>,
<a href="http://tez.apache.org/">Apache Tez</a>, and other
cluster frameworks. This is because the way you
describe a pipeline of operations in Visi can be
converted into a pipeline in many different
frameworks.
</p>

<p>
Let's get started.
</p>

<div class="org-src-container">

<pre class="src src-visi" id="first-example"><span style="color: #7F9F7F;">## Who lives with us?</span>
source residents <span style="color: #7CB8BB;">=</span>
 [{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 3}]

get_age(r) <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">get</span>(r, age:)

<span style="color: #7F9F7F;">## Get the ages</span>
ages <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">map</span>(get_age, residents)

sink the_ages <span style="color: #7CB8BB;">=</span> ages
</pre>
</div>

<p>
And we get:
</p>

<pre class="example">
[51, 11, 3]
</pre>

<p>
Note that we define the <code>source</code> and <code>sink</code> for the calculation.
A <code>source</code> is the name of a place that the information comes from.
When you're using your Visi notebook in interactive mode, you
can define a sample of data for a <code>source</code>. But when you deploy
the Visi notebook to your big data cluster, you can associate
sources and sinks with platform dependent data&#x2026; for example files
on your HDFS cluster. This mechanism let's your interactively
play with your calculations, get them right, and then
deploy <b>the same</b> Visi notebook to your cluster.
</p>

<p>
Okay&#x2026; back to creating a map/reduce job.
</p>

<p>
We've seen that we can <code>map</code> over data to get the <code>age</code> of each
record, the syntax is a little verbose. Let's build an inline
function that does the same thing:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="example2"><span style="color: #7F9F7F;">## Who lives with us?</span>
source residents <span style="color: #7CB8BB;">=</span>
 [{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 3}]

<span style="color: #7F9F7F;">## Get the ages</span>
ages <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">map</span>(r =&gt; <span style="color: #93E0E3;">get</span>(r, age:), residents)

sink the_ages <span style="color: #7CB8BB;">=</span> ages
</pre>
</div>

<pre class="example">
[51, 11, 3]
</pre>

<p>
A little better, but still more verbose than we'd
like. It turns out that a <code>keyword</code> is also a function, so
we can shorten the function to <code>age:</code> like so:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="example3"><span style="color: #7F9F7F;">## Who lives with us?</span>
source residents <span style="color: #7CB8BB;">=</span>
 [{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 3}]

<span style="color: #7F9F7F;">## Get the ages</span>
ages <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">map</span>(age:, residents)

sink the_ages <span style="color: #7CB8BB;">=</span> ages
</pre>
</div>

<pre class="example">
[51, 11, 3]
</pre>

<p>
Now, let's compute the sum of ages using the <code>reduce</code> function.
Yep, we're going to map <b>and</b> reduce&#x2026; woo hoo:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="example4"><span style="color: #7F9F7F;">## Who lives with us?</span>
source residents <span style="color: #7CB8BB;">=</span>
 [{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 3}]

<span style="color: #7F9F7F;">## Get the ages</span>
ages <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">map</span>(age:, residents)

age_sum <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">reduce</span>((<span style="color: #7CB8BB;">+</span>), ages)

sink sum <span style="color: #7CB8BB;">=</span> age_sum
</pre>
</div>

<pre class="example">
65
</pre>

<p>
The <code>reduce((+ ), ages)</code> expression adds up
each element in the ages collection. The <code>(+)</code>
expression creates a function that takes two
parameters and adds them up. The <code>(operator)</code>
syntax is another way of creating a function.
</p>

<p>
And we can compute the average age:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="example5"><span style="color: #7F9F7F;">## Who lives with us?</span>
source residents <span style="color: #7CB8BB;">=</span>
 [{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 3}]

<span style="color: #7F9F7F;">## Get the ages</span>
ages <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">map</span>(age:, residents)

age_sum <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">reduce</span>((<span style="color: #7CB8BB;">+</span>), ages)

sink sum <span style="color: #7CB8BB;">=</span> age_sum / <span style="color: #93E0E3;">count</span>(residents)
</pre>
</div>

<pre class="example">
65/3
</pre>

<p>
Note that Visi can express rational numbers&#x2026; numbers
that are ratios of each other. This means that Visi
avoids some floating point related issues.
</p>

<p>
So, yay&#x2026; we have created our first map/reduce job, except for
one thing&#x2026; the <code>count</code> function doesn't work so well over cluster,
so we'll have to aggregate the count as part of the reduce phase:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="example6"><span style="color: #7F9F7F;">## Who lives with us?</span>
source residents <span style="color: #7CB8BB;">=</span>
 [{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 3}]

<span style="color: #7F9F7F;">## Get the ages</span>
ages <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">map</span>(# {<span style="color: #93E0E3;">count</span>: 1, age: it.age}, residents)

age_sum <span style="color: #7CB8BB;">=</span> <span style="color: #93E0E3;">reduce</span>(| merge_with((<span style="color: #7CB8BB;">+</span>)), ages)

sink sum <span style="color: #7CB8BB;">=</span> age_sum.age / age_sum.<span style="color: #93E0E3;">count</span>
</pre>
</div>

<pre class="example">
65/3
</pre>

<p>
We've done a couple of things above&#x2026; the first is
we've introduced another mechanism for defining a
function. Putting a <code>#</code> and then a space before an expression
turns the expression into a function that takes one parameter
and that parameter is named <code>it</code> (a little homage to <a href="http://groovy.codehaus.org/">Groovy</a>).
</p>

<p>
The next thing we've introduced is another mechanism for getting
a value from an association. The <code>it.age</code> syntax is JavaScript-like
syntax that does the same thing as <code>get(age: it)</code>.
</p>

<p>
In the <code>age_sum</code> expression, we <code>reduce</code> over the <code>ages</code>
collection. But instead of just adding the elements, we must
merge the elements because they are associations. <code>merge_with</code>
takes a function and two associations and merges them. Each
for any common key in each association, the function is called
to combine the values at each shared key.
</p>

<p>
The <code>|</code> followed by a space is yet another syntax for creating
functions. In this case, they are partially applied functions.
A partially applied function has some parameters filled in and when
it's called, the balance of the parameters are filled in. The following
function declarations each do the same thing:
</p>

<ul class="org-ul">
<li>(x,y) =&gt; merge_ with((q, r) =&gt; q + r, x, y)
</li>
<li><code>#2 merge_with((+ ), it1, it2)</code>
</li>
<li><code>| merge_with((+))</code>
</li>
</ul>

<p>
So, we've created a series of steps to run a map/reduce
job in Visi. But Visi has some syntax that helps to make
map/reduce jobs easier to write and more obvious.
Visi allows you to write "transformation pipes" that
allow you to express the transformations in a single pipeline.
</p>

<div class="org-src-container">

<pre class="src src-visi" id="example7"><span style="color: #7F9F7F;">## Who lives with us?</span>
source residents <span style="color: #7CB8BB;">=</span>
 [{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 3}]

<span style="color: #7F9F7F;">## Run the whole job</span>
job <span style="color: #7CB8BB;">=</span> residents <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">map</span> # {<span style="color: #93E0E3;">count</span>: 1,
                          age: it.age}
                <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">reduce</span> | merge_with((<span style="color: #7CB8BB;">+</span>))

sink average_age <span style="color: #7CB8BB;">=</span> job.age / job.<span style="color: #93E0E3;">count</span>
</pre>
</div>

<pre class="example">
65/3
</pre>

<p>
Finally, Visi has helper functions that make your life
a lot easier&#x2026; like creating count associations based on
a key or merge/summing:
</p>

<div class="org-src-container">

<pre class="src src-visi" id="example8"><span style="color: #7F9F7F;">## Who lives with us?</span>
source residents <span style="color: #7CB8BB;">=</span>
 [{<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"David"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Human"</span>, age: 51},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Archer"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Dog"</span>, age: 11},
  {<span style="color: #93E0E3;">name</span>: <span style="color: #CC9393;">"Tessa"</span>, <span style="color: #93E0E3;">type</span>: <span style="color: #CC9393;">"Cat"</span>, age: 3}]

<span style="color: #7F9F7F;">## Run the whole job</span>
job <span style="color: #7CB8BB;">=</span> residents <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">map</span> count_for(age:)
                <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">reduce</span> merge_sum

sink average_age <span style="color: #7CB8BB;">=</span> job.age / job.<span style="color: #93E0E3;">count</span>
</pre>
</div>

<pre class="example">
65/3
</pre>

<p>
The <code>count_for</code> function returns a function that builds
a count association based on the key. The <code>merge_sum</code> function
is the same as <code>merge_with((+), x, y)</code>.
</p>

<p>
So, you've built your first map/reduce job in Visi and it's
pretty simple.
</p>

<p>
Next, we're going to go through some Visi pieces/parts.
</p>

<p>
You can also declare names that are only visible to expressions
that come after the declaration in the expression. This allows
you to compute an expression and use the result in many
places within a larger expression. For example:
</p>

<div class="org-src-container">

<pre class="src src-visi">test_income(income) <span style="color: #7CB8BB;">=</span>
  mag <span style="color: #7CB8BB;">=</span> Math:<span style="color: #BFEBBF;">:log</span>10(income) <span style="color: #7F9F7F;">## the magnitude of the income</span>
  <span style="color: #F0DFAF; font-weight: bold;">if</span> mag <span style="color: #7CB8BB;">&lt;</span> 3 <span style="color: #F0DFAF; font-weight: bold;">then</span> <span style="color: #CC9393;">"low"</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #F0DFAF; font-weight: bold;">if</span> mag <span style="color: #7CB8BB;">&lt;</span> 5 <span style="color: #F0DFAF; font-weight: bold;">then</span> <span style="color: #CC9393;">"med"</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #CC9393;">"high"</span>

<span style="color: #93E0E3;">map</span>(x =&gt; <span style="color: #93E0E3;">str</span>(x, <span style="color: #CC9393;">": "</span>, test_income(x)),
    [300, 50,000, 250,000])
</pre>
</div>

<pre class="example">
["300: low", "50000: med", "250000: high"]
</pre>

<p>
We compute the value of <code>mag</code> and then reference that
name in the <code>if/then/else</code> expression.
</p>

<p>
Also, note that the comma can be used as a number place separator. Put
spaces after commas to help the Visi parser distinguish between
<code>[100,240]</code> and <code>[100, 240]</code>.
</p>

<p>
Visi supports multiline, complex strings. A normal String is enclosed
in double quotes: ="I am a String"=. But sometimes, you might
want to have a double-quote in a string&#x2026; for example if you paste
a bunch of data you got off the Internet, you don't want to
have to escape the Strings. Visi has a handy, string literal.
Any sequence of characters that starts with <code>#</code> and two or more
single quote ('), double quote (") or carrot (^) and ends with
the same number/type of delimiter will be treated as a single string.
This is especially useful for putting CSV data into your Visi code:
</p>

<div class="org-src-container">

<pre class="src src-visi">[
 #'''Year,Make,Model,Description,Price''',
 #'''1997,Ford,E350,<span style="color: #CC9393;">"ac, abs, moon"</span>,3000.00''',
 #'''1999,Chevy,<span style="color: #CC9393;">"Venture ""Extended Edition"""</span>,<span style="color: #CC9393;">""</span>,4900.00''',
 #'''1999,Chevy,<span style="color: #CC9393;">"Venture ""Extended Edition, Very Large"""</span>,,5000.00''',
 #'''1996,Jeep,Grand Cherokee,<span style="color: #CC9393;">"MUST SELL!</span>
<span style="color: #CC9393;"> air, moon roof, loaded"</span>,4799.00'''
 ]
</pre>
</div>

<pre class="example">
["Year,Make,Model,Description,Price", "1997,Ford,E350,\"ac, abs, moon\",3000.00", "1999,Chevy,\"Venture \"\"Extended Edition\"\"\",\"\",4900.00", "1999,Chevy,\"Venture \"\"Extended Edition, Very Large\"\"\",,5000.00", "1996,Jeep,Grand Cherokee,\"MUST SELL!\n air, moon roof, loaded\",4799.00"]
</pre>

<p>
Now that we've got the pieces out to the way, let's do a word count example in Visi:
</p>

<div class="org-src-container">

<pre class="src src-visi">source king_james <span style="color: #7CB8BB;">=</span>
 [
   #'''Gen|1|1| In the beginning God created the heaven <span style="color: #93E0E3;">and</span> the earth.~''',
   #'''Gen|1|2| And the earth was without form, <span style="color: #93E0E3;">and</span> void; <span style="color: #93E0E3;">and</span> darkness was upon the face of the deep. And the Spirit of God moved upon the face of the waters.~''',
   #'''Gen|1|3| And God said, Let there be light: <span style="color: #93E0E3;">and</span> there was light.~''',
   #'''Gen|1|4| And God saw the light, that it was good: <span style="color: #93E0E3;">and</span> God divided the light from the darkness.~''',
   #'''Gen|1|5| And God called the light Day, <span style="color: #93E0E3;">and</span> the darkness he called Night. And the evening <span style="color: #93E0E3;">and</span> the morning were the <span style="color: #93E0E3;">first</span> day.~''',
   #'''Gen|1|6| And God said, Let there be a firmament in the midst of the waters, <span style="color: #93E0E3;">and</span> <span style="color: #93E0E3;">let</span> it divide the waters from the waters.~''',
   #'''Gen|1|7| And God made the firmament, <span style="color: #93E0E3;">and</span> divided the waters which were under the firmament from the waters which were above the firmament: <span style="color: #93E0E3;">and</span> it was so.~''',
   #'''Gen|1|8| And God called the firmament Heaven. And the evening <span style="color: #93E0E3;">and</span> the morning were the <span style="color: #93E0E3;">second</span> day.~''',
   #'''Gen|1|9| And God said, Let the waters under the heaven be gathered together unto one place, <span style="color: #93E0E3;">and</span> <span style="color: #93E0E3;">let</span> the dry land appear: <span style="color: #93E0E3;">and</span> it was so.~''',
   #'''Gen|1|10| And God called the dry land Earth; <span style="color: #93E0E3;">and</span> the gathering together of the waters called he Seas: <span style="color: #93E0E3;">and</span> God saw that it was good.~''',
   #'''Gen|1|11| And God said, Let the earth bring forth grass, the herb yielding seed, <span style="color: #93E0E3;">and</span> the fruit tree yielding fruit after his kind, whose seed is in itself, upon the earth: <span style="color: #93E0E3;">and</span> it was so.~''',
   #'''Gen|1|12| And the earth brought forth grass, <span style="color: #93E0E3;">and</span> herb yielding seed after his kind, <span style="color: #93E0E3;">and</span> the tree yielding fruit, whose seed was in itself, after his kind: <span style="color: #93E0E3;">and</span> God saw that it was good.~''',
   #'''Gen|1|13| And the evening <span style="color: #93E0E3;">and</span> the morning were the third day.~''',
   #'''Gen|1|14| And God said, Let there be lights in the firmament of the heaven to divide the day from the night; <span style="color: #93E0E3;">and</span> <span style="color: #93E0E3;">let</span> them be <span style="color: #F0DFAF; font-weight: bold;">for</span> signs, <span style="color: #93E0E3;">and</span> <span style="color: #F0DFAF; font-weight: bold;">for</span> seasons, <span style="color: #93E0E3;">and</span> <span style="color: #F0DFAF; font-weight: bold;">for</span> days, <span style="color: #93E0E3;">and</span> years:~''',
   #'''Gen|1|15| And <span style="color: #93E0E3;">let</span> them be <span style="color: #F0DFAF; font-weight: bold;">for</span> lights in the firmament of the heaven to give light upon the earth: <span style="color: #93E0E3;">and</span> it was so.~''',
   #'''Gen|1|16| And God made two great lights; the greater light to rule the day, <span style="color: #93E0E3;">and</span> the lesser light to rule the night: he made the stars also.~''',
   #'''Gen|1|17| And God <span style="color: #93E0E3;">set</span> them in the firmament of the heaven to give light upon the earth,~''',
   #'''Gen|1|18| And to rule over the day <span style="color: #93E0E3;">and</span> over the night, <span style="color: #93E0E3;">and</span> to divide the light from the darkness: <span style="color: #93E0E3;">and</span> God saw that it was good.~''',
   #'''Gen|1|19| And the evening <span style="color: #93E0E3;">and</span> the morning were the fourth day.~''',
   #'''Gen|1|20| And God said, Let the waters bring forth abundantly the moving creature that hath life, <span style="color: #93E0E3;">and</span> fowl that may fly above the earth in the open firmament of heaven.~''',
   #'''Gen|1|21| And God created great whales, <span style="color: #93E0E3;">and</span> every living creature that moveth, which the waters brought forth abundantly, after their kind, <span style="color: #93E0E3;">and</span> every winged fowl after his kind: <span style="color: #93E0E3;">and</span> God saw that it was good.~''',
   #'''Gen|1|22| And God blessed them, saying, Be fruitful, <span style="color: #93E0E3;">and</span> multiply, <span style="color: #93E0E3;">and</span> fill the waters in the seas, <span style="color: #93E0E3;">and</span> <span style="color: #93E0E3;">let</span> fowl multiply in the earth.~''',
   #'''Gen|1|23| And the evening <span style="color: #93E0E3;">and</span> the morning were the fifth day.~''',
 ]

to_remove <span style="color: #7CB8BB;">=</span> #{<span style="color: #CC9393;">"the"</span>, <span style="color: #CC9393;">"and"</span>}

counted_words <span style="color: #7CB8BB;">=</span> king_james
  <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">map</span> # re_replace(it, #//[^a-zA-Z]<span style="color: #7CB8BB;">+</span>//, <span style="color: #CC9393;">" "</span>) <span style="color: #7F9F7F;">## strip non-words</span>
  <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">map</span> # toLowerCase(it) <span style="color: #7F9F7F;">## convert to lower case</span>
  <span style="color: #7CB8BB;">|&gt;</span> flatmap | re_seq(#//\w+//) <span style="color: #7F9F7F;">## split by word</span>
  <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">filter</span> (<span style="color: #7CB8BB;">|&gt;</span> #{<span style="color: #CC9393;">"the"</span>, <span style="color: #CC9393;">"and"</span>, <span style="color: #CC9393;">"gen"</span>} <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">not</span>) <span style="color: #5F7F5F;">##</span> <span style="color: #93E0E3;">remove</span> <span style="color: #CC9393;">"the"</span>, <span style="color: #CC9393;">"gen"</span>, <span style="color: #93E0E3;">and</span> <span style="color: #CC9393;">"and"</span>
  <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">map</span> # {it 1} <span style="color: #7F9F7F;">## create association between word and number 1</span>
  <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">reduce</span> merge_sum <span style="color: #7F9F7F;">## count by word</span>
  <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">sort</span> <span style="color: #93E0E3;">second</span>, descending <span style="color: #7F9F7F;">## sort by count (the second part of the word/count pair)</span>

sink words <span style="color: #7CB8BB;">=</span> counted_words
</pre>
</div>

<pre class="example">
[["god", 22], ["was", 13], ["waters", 11], ["let", 11], ["in", 10], ["it", 10], ["earth", 10], ["light", 10], ["day", 9], ["of", 9]]
</pre>
</div>
</div>
</div>
