doc/why.org
** Immutability

Like Excel, Visi doesn't let you change a value once it's computed.
This is strange for users of Java and JavaScript. In addition to Visi's
syntax which is simple and free from complex stuff from Java like =void=
and =class= and such, Visi's types can be converted into a form that can
be distributed across a cluster of computes. Visi data types can be
turned into bytes that get turned back into the same data types on
the other side of the network.

Between serialization and immutability, Visi provides tools that make
writing distributed computing jobs simple.

** Host Interoperability

Visi sits on top of two host systems. All Visi code is compiled to
(well, more technically, transliterated to) [[http://clojure.org][Clojure]]. Then
the Clojure code is compiled into [[http://en.wikipedia.org/wiki/Java_virtual_machine][Java Virtual Machine]]
byte-code. This means that Visi code works with any Clojure and
Java library and Visi code can be used in and called by
any JVM-based Big Data platform.
Being able to work with any Java and Clojure library
means that you have a wealth of libraries to use. But how do you
use these libraries in Visi?

First, let's deal with method calls. Java objects all have methods.
Rather than using functions like Visi and Clojure, all the actions
that can be done to a particular Object is by invoking a method
on an Object.

Visi mostly makes method invocation seamless. If there's no
function matching the function name, then Visi invokes
that named method on the object. For example:

#+BEGIN_SRC visi :exports both

toString([1, 2, 3])

#+END_SRC

#+RESULTS:
: "[1 2 3]"

Boom, the =toString= method is invoked on the object. In this case,
the Vector in Visi is actually represented by a Clojure Vector
and we've called the =.toString= method on it.

You can be explicit about calling a method if there's ambiguity
about a name being in scope. By prefixing a function name with =$.=,
Visi forces the method invocation:

#+BEGIN_SRC visi :exports both

$.toString($.size([1, 2, 3]))

#+END_SRC

#+RESULTS:
: "3"

Visi also supports Java/JavaScript style method invocation:

#+BEGIN_SRC visi :exports both

x = [1, 2, 3]
  x.size().toString()

#+END_SRC

#+RESULTS:
: "3"

And if you want to force a method invocation rather than
a function call (if there is a function in scope with the same
name as the method you want to call):

#+BEGIN_SRC visi :exports both

x = [1, 2, 3]
  x$.size()$.toString()

#+END_SRC

#+RESULTS:
: "3"

Why the different ways to do the same thing?
Mostly because there will be times when it's
cleaner/easier to read/update when you use
one style or the other.

Mostly with the =$package= declaration. Note the =$=. This means
that you're explicitly using some form of host interoperability.

Using =$package=, you declare the name of the package your code
runs in (usually, =visi.notebook=) and you load any packages
you might need off the Internet, for example, the Apache
Commons CSV package.

#+BEGIN_SRC visi :exports both

$package(visi.notebook,
  load([org.apache.commons/commons-csv, "1.0"]),
  import(org.apache.commons.csv.CSVParser,
         org.apache.commons.csv.CSVFormat))

(CSVParser::parse(#'''1,2,"hello, moose",33,"thing"''', CSVFormat::DEFAULT))
  |> first ## get the first element
  |> seq ## turn it into a sequence


#+END_SRC

#+RESULTS:
: ["1", "2", "hello, moose", "33", "thing"]
