doc/why.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Immutability</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Like Excel, Visi doesn't let you change a value once it's computed.
This is strange for users of Java and JavaScript. In addition to Visi's
syntax which is simple and free from complex stuff from Java like <code>void</code>
and <code>class</code> and such, Visi's types can be converted into a form that can
be distributed across a cluster of computes. Visi data types can be
turned into bytes that get turned back into the same data types on
the other side of the network.
</p>

<p>
Between serialization and immutability, Visi provides tools that make
writing distributed computing jobs simple.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Host Interoperability</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Visi sits on top of two host systems. All Visi code is compiled to
(well, more technically, transliterated to) <a href="http://clojure.org">Clojure</a>. Then
the Clojure code is compiled into <a href="http://en.wikipedia.org/wiki/Java_virtual_machine">Java Virtual Machine</a>
byte-code. This means that Visi code works with any Clojure and
Java library and Visi code can be used in and called by
any JVM-based Big Data platform.
Being able to work with any Java and Clojure library
means that you have a wealth of libraries to use. But how do you
use these libraries in Visi?
</p>

<p>
First, let's deal with method calls. Java objects all have methods.
Rather than using functions like Visi and Clojure, all the actions
that can be done to a particular Object is by invoking a method
on an Object.
</p>

<p>
Visi mostly makes method invocation seamless. If there's no
function matching the function name, then Visi invokes
that named method on the object. For example:
</p>

<div class="org-src-container">

<pre class="src src-visi">toString([1, 2, 3])
</pre>
</div>

<pre class="example">
"[1 2 3]"
</pre>

<p>
Boom, the <code>toString</code> method is invoked on the object. In this case,
the Vector in Visi is actually represented by a Clojure Vector
and we've called the <code>.toString</code> method on it.
</p>

<p>
You can be explicit about calling a method if there's ambiguity
about a name being in scope. By prefixing a function name with <code>$.</code>,
Visi forces the method invocation:
</p>

<div class="org-src-container">

<pre class="src src-visi">$.toString($.size([1, 2, 3]))
</pre>
</div>

<pre class="example">
"3"
</pre>

<p>
Visi also supports Java/JavaScript style method invocation:
</p>

<div class="org-src-container">

<pre class="src src-visi">x <span style="color: #7CB8BB;">=</span> [1, 2, 3]
  x.size().toString()
</pre>
</div>

<pre class="example">
"3"
</pre>

<p>
And if you want to force a method invocation rather than
a function call (if there is a function in scope with the same
name as the method you want to call):
</p>

<div class="org-src-container">

<pre class="src src-visi">x <span style="color: #7CB8BB;">=</span> [1, 2, 3]
  x$.size()$.toString()
</pre>
</div>

<pre class="example">
"3"
</pre>

<p>
Why the different ways to do the same thing?
Mostly because there will be times when it's
cleaner/easier to read/update when you use
one style or the other.
</p>

<p>
Mostly with the <code>$package</code> declaration. Note the <code>$</code>. This means
that you're explicitly using some form of host interoperability.
</p>

<p>
Using <code>$package</code>, you declare the name of the package your code
runs in (usually, <code>visi.notebook</code>) and you load any packages
you might need off the Internet, for example, the Apache
Commons CSV package.
</p>

<div class="org-src-container">

<pre class="src src-visi">$package(visi.notebook,
  <span style="color: #93E0E3;">load</span>([org.apache.commons/commons-csv, <span style="color: #CC9393;">"1.0"</span>]),
  <span style="color: #93E0E3;">import</span>(org.apache.commons.csv.CSVParser,
         org.apache.commons.csv.CSVFormat))

(CSVParser:<span style="color: #BFEBBF;">:parse</span>(#'''1,2,<span style="color: #CC9393;">"hello, moose"</span>,33,<span style="color: #CC9393;">"thing"</span>''', CSVFormat:<span style="color: #BFEBBF;">:DEFAULT</span>))
  <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">first</span> <span style="color: #7F9F7F;">## get the first element</span>
  <span style="color: #7CB8BB;">|&gt;</span> <span style="color: #93E0E3;">seq</span> <span style="color: #7F9F7F;">## turn it into a sequence</span>
</pre>
</div>

<pre class="example">
["1", "2", "hello, moose", "33", "thing"]
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Pollak</p>
<p class="date">Created: 2015-02-07 Sat 15:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
